sandbox/template/linkserver/app/controllers/users_controller.rb

    def login
        # if authenticated, return a unique string for this user
        # we can use this to create a sessions ID... that is stored on the client for all future communications.... we look up session ID in database... before .... that is done in linking server anyway so it works fine
        if !params.has_key? :username or !params.has_key? :password
            head :invalid
            return
        end

        username = params[:username]
        password = params[:password]
        user = User.find_by(username: username, password: password)
        if user.blank?
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? AND "users"."password" = ? LIMIT ?  [["username", "arunganesan"], ["password", "super"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "arunganesan"], ["LIMIT", 1]]

    def createuser
        @return_message = ""

        if request.post?
            if !params.has_key? :username or !params.has_key? :password
                @return_message = "<font color='red'>Invalid form input</font>"
                return
            end
            username = params[:username]
            password = params[:password]
            user = User.find_by(username: username)
            if !user.blank?
                @return_message = "<font color='red'>User already exists</font>"
                return
            end

            user = User.new
            user.username = username
            user.password = password
            user.session = SecureRandom.hex
            user.save
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "alpha"], ["LIMIT", 1]]
INSERT INTO "users" ("username", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "arunganesan"], ["password", "saisam"], ["created_at", "2019-11-12 13:49:16.556336"], ["updated_at", "2019-11-12 13:49:16.556336"]]